{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Radio Venceremos was a radio broadcasted during the Civil War in El Salvador by the Farabundo Martí National Liberation Front, or FMLN. The Salvadoran Civil War was characterized like many rebel movements after World War II in Latin America that represented the struggle against authoritarian regimes that were imposed by the US government in securing the Western hemisphere against communism. The role of the Cuban Revolution in 1959 definitely played an integral role in allowing movements like those in El Salvador to believe that fighting and winning against the US-backed authoritative governments was a possibility. Unlike Chile or Nicaragua, whose revolutionary movements were squashed completely by the open military of the home governments as well as the covert operation of the CIA in the 1970s, the ending of the Salvadoran Civil War came with peace agreement between the FMLN and the current regime. This led to specific terms and promises to be made by the current regime, and ultimately, falling short in keeping those promises. Though the FMLN did become an official political party in El Salvador, some of the organizations that were in it at the beginning had left or changed. In the process of transition from revolutionary rebels to official politicians, many of the original reasons for revolution such as poverty and vast inequality between ordinary Salvadorans and city elites were left unaddressed. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://user-images.githubusercontent.com/122332459/218221500-c9e85ead-dfb9-42c6-a710-eb775249ab6e.png",
      "size": "medium",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "(Image from "
        },
        {
          "text": "Wikipedia",
          "link": "https://commons.wikimedia.org/wiki/File:Flag_of_FMLN.jpg"
        },
        {
          "text": ")"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Radio Venceremos was the radio-broadcasted program that served as propaganda and commentary against the oppression of the Salvadoran government. As ‘We Will Win’, or Radio Venceremos in English, served as a tool for the FMLN to coordinate and communicate with Salvadorans in the revolutionary effort and how they can help, but also served as way to spread news and keep people up to date on the government’s atrocities and recent attacks. The station also became part of the revolutionary culture in the sense that their story, as they constantly escape from the hands of the government, moving from place to place in order to continue their broadcast. One of the most iconic stories of the station is the death of Colonel Domingo Monterrosa of the Salvadoran Army who pioneered and attempted the search and destruction of Radio Venceremos. He had allegedly taken the radio equipment from a site as a trophy, believing he had squashed the radio and threat, when in actuality the equipment was a booby trap set up by the rebels that ultimately set off in his helicopter, killing him. Radio Venceremos also held a very practical and ordinary role as a radio station through their use of music and regular news. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://user-images.githubusercontent.com/122332459/218221634-2da09cae-eada-4591-a788-b44951cc871f.png",
      "size": "medium",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "(Image from "
        },
        {
          "text": "The SWLing Post",
          "link": "https://swling.com/blog/2019/06/radio-venceremos-a-salvadoran-civil-war-underground-station/"
        },
        {
          "text": ")"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "For many of these Latin American countries during their revolutions against the authoritarian regimes, the rise of technology and wide-spread accessibility of radios became integral to their communication with ordinary citizens, as the literacy rates were extremely low. Many of these revolutionary movements had programs for literacy in mind, much like those of the Cuban Revolution. The ability to lead a movement that was so connected to the ordinary Salvadoran is what has led to the strength and sustainability of the FMLN, which continues to be a major political party even to this day."
        }
      ]
    }
  ],
  "title": "Radio Venceremos: The Radio of the People",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "radio-venceremos-the-radio-of-the-people",
  "created_at": "2025-01-08T18:36:20.672Z",
  "created_by": "jackDeVry",
  "updated_at": "2025-01-08T18:36:20.672Z",
  "updated_by": "jackDeVry"
}